WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetAnyType_Client_Request-2.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetAnyType</a:Action>
    <a:MessageID>urn:uuid:68bb6253-7af4-4abf-82ad-12bef967dfda</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetAnyType xmlns="http://tempuri.org/">
      <inObject xmlns:d32="http://www.w3.org/2001/XMLSchema" i:type="d32:base64Binary" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns="">AQIDBAUGBwgJCg==</inObject>
    </RetAnyType>
  </s:Body>
</s:Envelope>